content/posts/Process_and_reality_by_Alfred_North_Whitehead_in_1929.md
+++
title = "Process and reality by Alfred North Whitehead in 1929"
author = ["Cameron Smith"]
lastmod = 2020-09-20T17:35:40-04:00
slug = "Process_and_reality_by_Alfred_North_Whitehead_in_1929"
draft = false
+++

## I. The Speculative Scheme {#i-dot-the-speculative-scheme}


### 1. Speculative philosophy {#1-dot-speculative-philosophy}

<!--list-separator-->

-  1.1 speculative philosophy; coherent logical necessary system of ideas; interpretation of experience

<!--list-separator-->

-  1.2 defects of insight and of language; conditions for observation; rigid empiricism, imagination, generalization; coherence and incoherence; creativity, the ultimate

<!--list-separator-->

-  1.3 rationalism and dogmatism; scheme as a matrix, false and true propositions, use of the matrix; experimental adventure

<!--list-separator-->

-  1.4 philosophy and science, grades of generality; dogmatic influence of mathematics; progress of philosophy

<!--list-separator-->

-  1.5 defects of language; propositions and their background; metaphysical presupposition; excessive trust in language; metaphysics and practice; metaphysics and linguistic expression

<!--list-separator-->

-  1.6 speculative philosophy and over ambition; over ambition, dogmatism and progress; interpretation and metaphysics; The higher elements of experience, subjectivity and the metaphysical correction; morality, religion, science, connected by philosophy; contrast between religion and science; conclusion


###  {#}
